---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PlanViewRange
source: html/7a02b51b-fae0-8f0a-a7f7-1e3697c72255.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PlanViewRange Property

"View Range"

## Syntax (C#)
```csharp
public static ForgeTypeId PlanViewRange { get; }
```